Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: imagerectangle() creates a rectangle of color col in image image starting at upper left coordinate x1, y1 and ending at bottom right coordinate x2, y2.
es: ImageRectangle crea un rectángulo de color col en la imagen im comenzando en la coordenada superior izquierda x1,y1 y finalizando en la coordenada inferior derecha x2,y2.

source: imagesetpixel() draws a pixel at x, y (top left is 0, 0) in image image of color col.
es: ImageSetPixel dibuja un pixel x,y (arriba izquierda 0,0) en la imagen im con color col.

source: Example 1. imagesetstyle() example
es: Ejemplo 1. imagesetstyle() example

source: imagestring() draws the string s in the image identified by image at coordinates x, y (top left is 0, 0) in color col.
es: ImageString dibuja la cadena s en la imagen identificada por im en las coordenadas x,y (arriba izquierda es 0,0) en el color col.

source: imagestringup() draws the string s vertically in the image identified by image at coordinates x, y (top left is 0, 0) in color col.
es: ImageStringUp dibuja la cadena s verticalmente en la imagen identificada por im en las coordenadas x,y (arriba izquierda es 0,0) en el color col.

source: imagesx() returns the width of the image identified by image.
es: ImageSX devuelva la anchura de la imagen identificado por im.

source: See also imagecreate() and imagesy().
es: Vea también imagecreate() y imagesy().

source: imagesy() returns the height of the image identified by image.
es: ImageSY devuelve la altura de la imagen identificada por im.

source: See also imagecreate() and imagesx().
es: Vea también imagecreate() y imagesx().

source: This function calculates and returns the bounding box in pixels for a TrueType text.
es: Esta función calcula y devuelve un rectángulo en pixels que encierra un texto con TrueType.

source: The string to be measured.
es: La cadena que ha de ser medida.

source: The font size in pixels.
es: El tamaño de la fuente.

source: The name of the TrueType font file. (Can also be an URL.) Depending on which version of the GD library that PHP is using, it may attempt to search for files that do not begin with a leading '/' by appending '.ttf 'to the filename and searching along a library-defined font path.
es: El nombre del archivo de fuente TrueType. (Puede ser también una URL.)

source: Angle in degrees in which text will be measured.
es: Ángulo en grados en el text que va a ser medido.

source: lower left corner, X position
es: esquina inferior izquierda, posición X

source: lower left corner, Y position
es: esquina inferior izquierda, posición Y

source: lower right corner, X position
es: esquina inferior derecha, posición X

source: lower right corner, Y position
es: esquina inferior derecha, posición Y

source: upper right corner, X position
es: esquina superior derecha, posición X

source: upper right corner, Y position
es: esquina superior derecha, posición Y

source: upper left corner, X position
es: esquina superior izquierda, posición X

source: upper left corner, Y position
es: esquina superior izquierda, posición Y

source: This function requires both the GD library and the FreeType library.
es: Esta función requiere tanto la libreria GD como la libreria Freetype.

source: See also imagettftext().
es: Vea también ImageTTFText().

source: Depending on which version of the GD library that PHP is using, when fontfile does not begin with a leading '/', '.ttf 'will be appended to the filename and the library will attempt to search for that filename along a library-defined font path.
es: ImageTTFText escribe la cadena text en la imagen identificada por im, comenzando en las coordenadas x,y (arriba izquierda es 0,0), con un ángulo de angle en el color col, usando el ficheor de fuente TrueType identificado por fontfile.

source: The coordinates given by x, y will define the basepoint of the first character (roughly the lower-left corner of the character).
es: Las coordenadas dadas por x, y definirán el punto base del primer carácter. (la esquina inferior izquierda del carácter).

source: angle is in degrees, with 0 degrees being left-to-right reading text (3 o'clock direction), and higher values representing a counter-clockwise rotation. (i.e., a value of 90 would result in bottom-to-top reading text).
es: El angle viene dado en grados, donde 0 grados representa el texto de izquierda a derecha (dirección las 3 en punto), y valores superiores representan una rotación en el sentido de las agujas de un reloj. (ej. un valor de 90 representaría un texto que fuese de abajo hacia arriba).

source: fontfile is the path to the TrueType font you wish to use.
es: fontfile es la ruta hacia la fuente TrueType que desee usar.

source: text is the text string which may include UTF-8 character sequences (of the form: #123;) to access characters in a font beyond the first 255.
es: 123;) para acceder a caracteres de la fuente más allá de los primeros 255.

source: Col is the color index.
es: col es el índice de color.

source: Using the negative of a color index has the effect of turning off antialiasing.
es: El uso de un índice de color negativo tiene el efecto de desactivar el antialiasing.

source: The order of the points is lower left, lower right, upper right, upper left.
es: ImageTTFText() devuelve una matriz con 8 elementos representando cuatro puntos que hace una caja que cubre el texto.El orden de los puntos en arriba izquierda, arriba derecha, abajo derecha, abajo izquierda.

source: The points are relative to the text regardless of the angle, so "upper left" means in the top left-hand corner when you see the text horizontallty.
es: Los puntos son relativos al texto a pesar del ángulo, por lo que "arriba izquierda" significa en la esquina superior izquierda cuando ve el texto horizontalmente.

source: This example script will produce a black GIF 400x30 pixels, with the words "Testing..." in white in the font Arial.
es: Este script de ejemplo producirá un GIF negro de 400x30 pixels, con las palabras "Testing..." en blanco con la fuente Arial.

source: Example 1. imagettftext() example
es: ImageTTFText

source: ?php header( "Content-type: image / jpeg"); $im = imagecreate(400,30); $white = imagecolorallocate($im, 255,255,255); $black = imagecolorallocate($im, 0,0,0); / / Replace path by your own font path imagettftext($im, 20, 0, 10, 20, $black, "/ path / arial.ttf", "Testing...
es: ?php Header( "Content-type: image / gif"); $im = imagecreate(400,30); $black = ImageColorAllocate($im, 0,0,0); $white = ImageColorAllocate($im, 255,255,255); ImageTTFText($im, 20, 0, 10, 20, $white, "/ path / arial.ttf", "Testing...

source: Omega: amp; #937 ;"); imagejpeg($im); imagedestroy($im);?
es: Omega: #937; "); ImageGif($im); ImageDestroy($im);?

source: See also imagettfbbox().
es: Vea también ImageTTFBBox().

source: Example 1. imagetypes
es: Ejemplo 1. imagetypes

source: Example 1. image_type_to_mime_type (file)
es: Ejemplo 1. image_type_to_mime_type (file)

source: Convert an 8bit string to a quoted-printable string (according to RFC2045, section 6.7).
es: Convierte una cadena de 8bit a una cadena quoted-printable.

source: See also imap_qprint().
es: Devuelve una cadena quoted-printable

source: IMAP, POP3 and NNTP functions
es: Funciones IMAP

source: This function returns an array of all of the IMAP alert messages generated since the last imap_alerts() call, or the beginning of the page.
es: Esta función devuelve un array con todos los mensajes de alerta IMAP generados desde la última llamada a imap_alerts(), o el comienzo de la pagina.

source: When imap_alerts() is called, the alert stack is subsequently cleared.
es: Cuando se llama a imap_alerts(), la pila de alerta es inicializada.

source: The IMAP specification requires that these messages be passed to the user.
es: La especificación IMAP requiere que estos mensajes sean pasados al usuario.

source: Returns TRUE on sucess, FALSE on error.
es: Devuelve TRUE si no hay error y FALSE en caso contrario.

source: imap_append() appends a string message to the specified mailbox mbox.
es: imap_append() agrega una cadena de mensaje al buzón especificado mbox.

source: If the optional options is specified, writes the options to that mailbox also.
es: Si se especifica el parámetro flags, escribe las opciones o condiciones establecidas en el parámetro flags al buzón.

source: Example 1. imap_append() example
es: Cuando conecte con el servidor Cyrus IMAP, debe usar "\r\n" como finalizador de linea en vez de "\n "o la operación fallará.

source: imap_base64() function decodes BASE-64 encoded text (see RFC2045, Section 6.8).
es: imap_base64() decodifica texto codificado en BASE-64.

source: See also imap_binary().
es: El mensaje decodificado es devuelto como una cadena.

source: Convert an 8bit string to a base64 string (according to RFC2045, Section 6.8).
es: Convierte una cadena de 8bit a una cadena base64.

source: See also imap_base64().
es: Devuleve una cadena base64.

source: The optional flags are a bit mask with one or more of the following:
es: imap_body() devuelve el cuerpo del mensaje, numerado msg_number del buzón actual.

source: FT_PEEK - Do not set the \Seen flag if not already set
es: Los flags opcionales son una máscara de bit con una o mas de las siguientes:

source: FT_INTERNAL - The return string is in internal format, will not canonicalize to CRLF.
es: FT_UID - El msgno es un UID

source: imap_body() will only return a verbatim copy of the message body.
es: FT_PEEK - No activar \Seen flag si no está ya activa

source: To extract single parts of a multipart MIME-encoded message you have to use imap_fetchstructure() to analyze its structure and imap_fetchbody() to extract a copy of a single body component.
es: FT_INTERNAL - La cadena devuelta está en formato interno, no canoniza a CRLF.

source: The imap_check() function checks the current mailbox status on the server and returns the information in an object with following properties:
es: Devuelve información acerca del buzón actual.

source: Driver - protocol used to access this mailbox:
es: Devuelve FALSE si falla.

source: Mailbox - the mailbox name
es: La función imap_check() comprueba el estado del buzón actual en el servidor y devuelve la información en un objeto con las siguientes propiedades.

source: Recent - number of recent messages in the mailbox
es: Date: fecha del mensaje Driver: controlador Mailbox: nombre del buzón Nmsgs: número de mensajes Recent: número de mensajes recientes

source: The flags which you can unset are "\\Seen", "\\Answered", "\\Flagged", "\\Deleted", and "\\Draft" (as defined by RFC2060).
es: Esta funcion elimina el flag especificado del conjunto de flags activos para los mensajes en la secuencia especificada.

source: The options are a bit mask with one or more of the following:
es: Las opciones son una máscara de bit con uno o más de los siguientes:

source: ST_UID The sequence argument contains UIDs instead of sequence numbers
es: ST_UID El argumento sequence contiene UIDs en vez de nÃºmeros secuenciales

source: Close the imap stream.
es: Cierra una sesión imap.

source: Takes an optional flag CL_EXPUNGE, which will silently expunge the mailbox before closing, removing all messages marked for deletion.
es: Toma un parámetro flag opcional, CL_EXPUNGE, el cual purgará el buzón de forma trasparente antes de cerrarla.

source: Names containing international characters should be encoded by imap_utf7_encode()
es: imap_createmailbox() crea un buzón nuevo especificado por mbox (ver imap_open() para el formato del parámetro mbox).

source: See also imap_renamemailbox(), imap_deletemailbox() and imap_open() for the format of mbox names.
es: Devuelve TRUE si no hay error y FALSE en caso contrario.

source: $mbox = imap_open( "{your.imap.host}" ,"username" ,"password",OP_HALFOPEN) or die("can't connect: ".imap_last_error()); $name1 = "phpnewbox"; $name2 = imap_utf7_encode("phpnewb ouml;x"); $newname = $name1; echo "Newname will be '$name1 'br \n"; # we will now create a new mailbox "phptestbox "in your inbox folder, # check its status after creation and finaly remove it to restore # your inbox to its initial state if(@imap_createmailbox($mbox,imap_utf7_encode("{your.imap.host}INBOX.$newname"))) {$status = @imap_status($mbox ,"{your.imap.host}INBOX.$newname",SA_ALL); if($status) {print("your new mailbox '$name1' has the following status: br \n"); print("Messages:". $status - messages). "br \n"; print("Recent:". $status - recent). "br \n"; print("Unseen:". $status - unseen). "br \n"; print("UIDnext:". $status - uidnext). "br \n"; print("UIDvalidity :". $status - uidvalidity)." br \n"; if(imap_renamemailbox($mbox ,"{your.imap.host}INBOX.$newname" ,"{your.imap.host}INBOX.$name2")) {echo "renamed new mailbox from '$name1 'to '$name2' br \n"; $newname=$name2;} else {print "imap_renamemailbox on new mailbox failed: ".imap_last_error(). "br \n";}} else {print "imap_status on new mailbox failed: ".imap_last_error()." br \n";} if(@imap_deletemailbox($mbox ,"{your.imap.host}INBOX.$newname")) {print "new mailbox removed to restore initial state br \n";} else {print "imap_deletemailbox on new mailbox failed: ".implode( "br \n",imap_errors())." br \n";}} else {print "could not create new mailbox: ".implode( "br \n",imap_errors())." br \n";} imap_close($mbox);
es: Ver También imap_renamemailbox() y imap_deletemailbox().

source: imap_delete() marks messages listed in msg_number for deletion.
es: Devuelve TRUE.

source: Messages marked for deletion will stay in the mailbox until either imap_expunge() is called or imap_close() is called with the optional parameter CL_EXPUNGE.
es: La función imap_delete() marca el mensaje referenciado por msg_number para su eliminación.

source: Example 1. imap_delete() Beispiel
es: El borrado físico de los mensajes es realizado por imap_expunge().

source: imap_deletemailbox() deletes the specified mailbox (see imap_open() for the format of mbox names).
es: imap_deletemailbox() elimina el buzón especificado (ver imap_open() para el formato del mbox).

source: Returns TRUE on success and FALSE on error.
es: Devuelve TRUE si no hay error y FALSE en caso contrario.

source: See also imap_createmailbox(), imap_renamemailbox(), and imap_open() for the format of mbox.
es: Ver También imap_createmailbox() y imap_reanmemailbox().

source: This function returns an array of all of the IMAP error messages generated since the last imap_errors() call, or the beginning of the page.
es: Esta función devuelve un array de todos los mensajes de error IMAP generados desde la última llamada a imap_errors(), o el principio de la página.

source: When imap_errors() is called, the error stack is subsequently cleared.
es: ATENCIàN: esta función no esta disponible aún en PHP4.

source: imap_expunge() deletes all the messages marked for deletion by imap_delete(), imap_mail_move(), or imap_setflag_full().
es: imap_expunge() elimina todos los mensajes marcados por la función imap_delete().

source: Returns TRUE.
es: Devuleve TRUE.

source: This function causes a fetch of a particular section of the body of the specified messages as a text string and returns that text string.
es: Esta función busca una sección particular en el cuerpo de los mensajes especificados, como una cadena de texto y devuleve esa cadena.

source: The section specification is a string of integers delimited by period which index into a body part list as per the IMAP4 specification.
es: La especificación de la sección es una cadena de enteros delimitados por comas,los cuales indexan las partes del cuerpo como indica la especificación IMAP4.

source: Body parts are not decoded by this function.
es: Partes del cuerpo no son decodificadas por esta función.

source: The options for imap_fetchbody() is a bitmask with one or more of the following:
es: Las opciones para imap_fetchbody () son una máscara de bit con una o más de las siguientes

source: FT_UID - The msg_number is a UID
es: FT_UID - El msgono es un UID

source: See also: imap_fetchstructure().
es: FT_INTERNAL - La cadena devuelta está en formato "interno", sin ningún intento por canonizar CRLF

source: This function causes a fetch of the complete, unfiltered RFC2822 format header of the specified message as a text string and returns that text string.
es: Esta función localiza el formato de la cabecera RFC 822 del mensaje especificado como una cadena de texto y devuelve esa cadena de texto.

source: FT_UID The msgno argument is a UID FT_INTERNAL The return string is in "internal" format, without any attempt to canonicalize to CRLF newlines FT_PREFETCHTEXT The RFC822.TEXT should be pre-fetched at theFT_UID The msgno argument is a UID FT_INTERNAL The return string is in "internal "format, without any attempt to canonicalize to CRLF newlines FT_PREFETCHTEXT The RFC822.TEXT should be pre-fetched at the same time.
es: FT_UID El argumento msgno es un UID FT_INTERNAL La cadena devuelta esta en formato "interno", sin ningún intento de canonizar CRLF FT_PREFETCHTEXT The RFC822.TEXT should be pre-fetched at theFT_UID El argumento msgno es un UID FT_INTERNAL La cadena devuelta esta en formato "interno", sin ningún intento de canonizar CRLF FT_PREFETCHTEXT The RFC822.TEXT should be pre-fetched at the same time.

source: This avoids an extra RTT on an IMAP connection if a full message text is desired (e.g. in a "save to local file "operation)
es: Esto evita un extra RTT en una conexión IMAP si se desea un mensaje completo de texto (e.g. en una operación de "guardar a un fichero local")

source: Example 1. imap_fetch_overview() example
es: Ejemplo 1. imap_fetch_overview() example

source: This function fetches all the structured information for a given message.
es: Esta función busca toda la información estructurada en el mensaje especificado.

source: The optional flags parameter only has a single option, FT_UID, which tells the function to treat the msg_number argument as a UID.
es: El parámetro opcional flags sólo tiene una opcion, FT_UID, la cual indica a la función que trate el argumento msg_number como un UID.

source: The returned object includes the envelope, internal date, size, flags and body structure along with a similar object for each mime attachement.
es: El objeto devuelto incluye el sobre, la fecha interna, el tama¤o, flags y la estructura del cuerpo con un objeto similar por cada mime adjunto al mensaje.

source: The structure of the returned objects is as follows:
es: La estructura de los objetos devueltos es como sigue:

source: Returned Objects for imap_fetchstructure()
es: Objetos Devueltos para imap_fetchstructure()

source: Primary body type
es: Tipo primario del cuerpo

source: TRUE if there is a subtype string
es: TRUE si hay una cadena de subtipo

source: ifdescription
es: ifDescripción

source: TRUE if there is a description string
es: TRUE si hay una cadena de Descripción

source: Content description string
es: Conenido de la cadena de Descripción

source: TRUE if there is an identification string
es: TRUE si hay una cadena de identificación

source: Identification string
es: Cadena de Identificación

source: Number of lines
es: Número de lineas

source: Number of bytes
es: Número de bytes

source: TRUE if there is a disposition string
es: TRUE si hay una cadena de configuración

source: Disposition string
es: Cadena de configuración

source: TRUE if the dparameters array exists
es: TRUE si el array dparameters existe

source: dparameters
es: dparameters [a]

source: An array of objects where each object has an "attribute" and a "value "property corresponding to the parameters on the Content-disposition MIME header.
es: Array de parametro de configuración

source: ifparameters
es: TRUE si el array de parámetros existe

source: TRUE if the parameters array exists
es: parameters [b]

source: parameters
es: MIME parameters array

source: An array of objects where each object has an "attribute" and a "value "property.
es: Array de objetos describiendo cada parte del mensaje

source: An array of objects identical in structure to the top-level object, each of which corresponds to a MIME body part.
es: Notas: a. dparameters es un array de objetos donde cada objeto tiene un "atributo" y una propiedad "valor". b. parameter es un array de objetos donde cada objetor tiene un "atributo "y una propiedad "valor". c. parts es un array de objetos identico en estructura al objeto del primer nivel, con la limitación de que este no puede contener más objetos 'parts '.

source: Table 2.
es: Tabla 2.

source: text
es: texto

source: multipart
es: multiparte

source: message
es: mensaje

source: application
es: aplicación

source: image
es: imagen

source: other
es: otro

source: Table 3.
es: Tabla 3.

source: Transfer encodings
es: Codificacion para tranferencia

source: See also: imap_fetchbody().
es: OTRO

source: Returns an array of objects containing mailbox information.
es: Devuelve un array de objetos coneniendo información del buzón.

source: Attributes is a bitmask that can be tested against:
es: Cada objeto tiene los atributos name, especificando el nombre completo del buzón; delimiter, que es el delimitador jerárquico para la parte de la jerarquía dónde está este buzón; y attributes.

source: LATT_NOINFERIORS - This mailbox has no "children" (there are no mailboxes below this one).
es: Attributes es una máscara de bits contra la que se puede probar:

source: LATT_NOSELECT - This is only a container, not a mailbox - you cannot open it.
es: LATT_NOINFERIORS - Este buzón no tiene "hijos" (No ha buzones por debajo de él)

source: Only used by UW-IMAPD.
es: LATT_NOSELECT - Esto es sólo un contenedor, no un buzón - No puede abrirlo.

source: LATT_UNMARKED - This mailbox is not marked.
es: LATT_MARKED - Este buzón está marcado.

source: Mailbox names containing international Characters outside the printable ASCII range will be encoded and may be decoded by imap_utf7_decode().
es: Unicamente usado por UW-IMAPD.

source: If you want all mailboxes, pass' * 'for pattern.
es: ref normalmente debería ser solo el servidor IMAP, de la forma: {imap_server:imap_port}, y pattern especifica, dónde en la estructura jerárquica del buzón, para comenzar a buscar.

source: There are two special characters you can pass as part of the pattern: '*' and '%'. '* 'means to return all mailboxes.
es: Si quiere todo los buzones, pase el parámetro pattern como una cadena vacía.

source: Example 1. imap_getmailboxes() example
es: Hay dos caracteres especiales que puede pasar como parte del parámetro pattern: '*' and '%'. '* 'significa que devuelva todos los buzones.

source: See also imap_getsubscribed().
es: Pasar '%' en el parámetro pattern devolverá sólo el nivel más alto de los buzones; '~ / mail /% 'en UW_IMAPD devolverá cada buzón del directorio ~ / mail, pero ninguno de los subdirectorios de ese directorio.

source: Example 1. imap_get_quota() example
es: Ejemplo 1. imap_get_quota() example

source: Example 2. imap_get_quota() 4.3 or greater example
es: Ejemplo 2. imap_get_quota() 4.3 or greater example

source: Example 1. imap_get_quotaroot() example
es: Ejemplo 1. imap_get_quotaroot() example

source: This function is identical to imap_getmailboxes(), except that it only returns mailboxes that the user is subscribed to.
es: Esta función es idéntica a imap_getmailboxes(), excepto que esta sólo devuelve los buzones a los que está subscrito el usuario.

source: (PHP 3, PHP 4)
es: remail, date, Date, subject, Subject, in_reply_to, message_id, newsgroups, followup_to, references message flags:
